print('练习')  # 输出单个字符串'练习'
print('1024 * 768 =',1024*768)  # 输出1024*768的计算结果'786432'
result =1024*768  # 定义变量result为1024*768的计算结果786432
print('1024 * 768 =',result)  # 输出算式结果'1024 * 768 = 786432'
result =input(1024*768)  # 定义变量result并输入1024*768的结果786432
print('1024 * 768 =',result)  # 输出算式结果'1024 * 768 = 786432'
a = 1  # 定义变量a=1
b = 2  # 定义变量b=2
c = 3  # 定义变量c=3
d = 4  # 定义变量d=4
print(a,b,c,d)  # 输出4个变量对应的数字，1 2 3 4
a,b,c,d=4,3,2,1  # 依次定义4个变量a，b，c，d，分别等于4，3，2，1
print(a,b,c,d)  # 输出4个变量对应的数字，4 3 2 1